LEXICON_RU = {
    "/start": "Привет! Я бот, с которым можно сыграть в игру "
              "'камень-ножницы-бумага'.\n\n"
              "Правила можно посмотреть, нажав на /help\n\n"
              "Хочешь сыграть? Нажимай на кнопки внизу :)",
    "/help": "Правила следующие:\n"
              "Камень разбивает ножницы, бумага оборачивает камень, "
              "ножницы режут бумагу.\n"
              "Выбирай одну из кнопок ниже и выясним, кто победил :)",
    "unknown command": "Не понимаю :( Посмотреть как со мной общаться "
              "можно, нажав на /start",
    "start game": "Отлично! Делай свой выбор!",
    'no start game': "Жаль... Если передумаешь, просто открой клавиатуру "
              "и нажми 'Давай!'"
}
